[
  {
    "job_title": "User Experience Designer",
    "company": "VectorShift",
    "company_url": "https://www.linkedin.com/company/vectorshift/life",
    "location": null,
    "posted_date": "India · 41 minutes ago · 65 applicants\n\nPromoted by hirer · No response insights available yet",
    "applicant_count": "India · 41 minutes ago · 65 applicants\n\nPromoted by hirer · No response insights available yet",
    "job_url": "https://www.linkedin.com/jobs/view/4360841680/",
    "description": "About the job\n\nYou will partner closely with our founders and engineering team to own the design function at VectorShift. This is a hybrid role for a versatile designer who loves variety: one day you might be solving a complex UX problem for our workflow builder, and the next you might be build chat experiences from our 100k+ users.\n\n\n\n\nYou aren’t just \"making things pretty\"—you are translating abstract AI logic into an intuitive, powerful interface that feels magical to use.\n\n\n\n\nWhat You’ll Do:\n\nProduct Experience (The Core)\n\nOwn the detailed UX/UI: Lead end-to-end design for VectorShift’s core features, including our no-code pipeline builder, node logic, and data integrations.\nSimplify Complexity: Take complex technical concepts (variables, loops, LLM chains) and turn them into simple, drag-and-drop interfaces that non-engineers can understand.\nShip Real Software: Deliver high-fidelity Figma mocks and prototypes that are ready for engineering. Work side-by-side with devs to ensure the final build matches the design specs.\nBuilding Delightful Experiences: build end user experiences that make the users come back over and over again\n\n\n\n\nWho You Are\n\n1+ Years Experience: You have a strong background in Product Design, ideally at a SaaS, DevTool, or Productivity startup.\nPortfolio that shows \"Logic\": You can share a portfolio that goes beyond pretty pictures. We want to see Case Studies that explain how you solved a difficult problem, from wireframe to final pixel.\nFigma Master: You are fast and efficient in Figma. You know how to use auto-layout and components to keep files organized.\nTechnical Aptitude: You don't need to code, but you understand how software is built. You can speak the language of engineers and understand constraints.\nScrappy & Fast: You are comfortable with the \"mess\" of a startup. You don't need a 30-page brief to get started; you ask questions and iterate quickly.\n\n\n\n\nWhy Join VectorShift\n\nHigh Ownership: You are not a cog in a machine. You are the design voice of the company.\nCategory Creation: You are helping define the UI/UX for the emerging field of AI automation.\nDirect Impact: Your work will be shipped to thousands of users immediately. No red tape.",
    "company_details": {
      "headquarters": null,
      "founded": null,
      "industry": "Technology, Information and Internet",
      "company_size": "2-10 employees"
    }
  },
  {
    "job_title": "Senior UI/UX Designer - REMOTE",
    "company": "Jobgether",
    "company_url": "https://www.linkedin.com/company/jobgether/life",
    "location": null,
    "posted_date": "India · 45 minutes ago · 10 people clicked apply\n\nResponses managed off LinkedIn",
    "applicant_count": null,
    "job_url": "https://www.linkedin.com/jobs/view/4364081558/",
    "description": "About the job\n\nThis position is posted by Jobgether on behalf of a partner company. We are currently looking for a Principal Product Designer - REMOTE. In this role, you will have the unique opportunity to shape the design direction of innovative products that enhance customer experiences. By elevating design practices and leveraging AI-powered solutions, your work will significantly impact product evolution and user satisfaction. As a senior individual contributor, you will influence cross-functional teams and help bridge the gap between product vision and execution. Your expertise will be vital in driving high-quality design outcomes and fostering an environment of creative collaboration. This role offers you the chance to bring your vast experience to lead complex design challenges in a dynamic setting.\n\nAccountabilities\n\n\nTranslate product and company vision into opinionated, future-forward design direction across major product areas\nThink beyond near-term delivery to explore long-term opportunities, using concepts and prototypes to shape product evolution\nDefine and champion design principles and systems that support enterprise-ready, AI-forward experiences\nLead complex, ambiguous design problems end-to-end, from framing and exploration through execution and refinement\nPartner deeply with Product, Engineering, and GTM to influence roadmaps and strategic decisions\nUse customer research, product data, and insight to inform decisions while applying strong independent judgment\nRaise the bar for design quality through critique, mentorship, and design leadership without people management\n\n\nRequirements\n\n\n8+ years of product design experience, ideally with B2B SaaS, platforms, or complex products\nDemonstrated experience designing AI-enabled products, automation, or intelligent workflows\nStrong prototyping skills used for vision-setting and alignment\nProven ability to take abstract product vision and turn it into a cohesive design vision\nStrong systems thinker with experience designing for scale, extensibility, and long-term impact\nExceptional craft paired with strategic thinking and comfort operating in ambiguity\nTrack record of influencing cross-functional partners and driving alignment\nExperience mentoring designers and elevating team practices through example\nComfort collaborating closely with front-end engineers and understanding technical constraints\nA strong point of view grounded in user outcomes and business impact\n\n\nBenefits\n\n\n100% remote - All employees learn and collaborate using remote work practices\nSolid health, dental, and vision plans; access to 401k (with a match), and generous parental leave\nOne-time $1000 home office stipend and an additional $500 annual budget for extra work-related technology\nMonthly co-working space fees reimbursement available\nEquity granted to every employee, investing everyone in our success\nTeam alignment through various meetings, newsletters, and annual learning stipends\nFlexible Time Off policy allowing employees to schedule time off when needed\n\n\nWhy Apply Through Jobgether?\n\nWe use an AI-powered matching process to ensure your application is reviewed quickly, objectively, and fairly against the role's core requirements. Our system identifies the top-fitting candidates, and this shortlist is then shared directly with the hiring company. The final decision and next steps (interviews, assessments) are managed by their internal team.\n\nWe appreciate your interest and wish you the best!\n\nData Privacy Notice: By submitting your application, you acknowledge that Jobgether will process your personal data to evaluate your candidacy and share relevant information with the hiring employer. This processing is based on legitimate interest and pre-contractual measures under applicable data protection laws (including GDPR). You may exercise your rights (access, rectification, erasure, objection) at any time.\n\nWe may use artificial intelligence (AI) tools to support parts of the hiring process, such as reviewing applications, analyzing resumes, or assessing responses. These tools assist our recruitment team but do not replace human judgment. Final hiring decisions are ultimately made by humans. If you would like more information about how your data is processed, please contact us.",
    "company_details": {
      "headquarters": null,
      "founded": null,
      "industry": null,
      "company_size": "11-50 employees"
    }
  },
  {
    "job_title": "Mendix Architect",
    "company": "Intellistaff Services Pvt. Ltd",
    "company_url": "https://www.linkedin.com/company/intellistaff-services-pvt-ltd/life",
    "location": null,
    "posted_date": "Hyderabad, Telangana, India · 1 hour ago · 9 applicants\n\nPromoted by hirer · No response insights available yet",
    "applicant_count": "Hyderabad, Telangana, India · 1 hour ago · 9 applicants\n\nPromoted by hirer · No response insights available yet",
    "job_url": "https://www.linkedin.com/jobs/view/4353784275/",
    "description": "About the job\n\nPosition name: Mendix-Architect\n\nlocation: Anywhere in India\n\nyrs of exp: 12 years (5 YEARS IN Mendix) \n\nNotice Period: Immediate Joiners to 60 Days NP\n\nshift timings: 2 – 11 PM\n\nMandatory skills\n\nMinimum five years of relevant Solution Architecture/lead experience with a good understanding of the aPaaS/PaaS and Low Code No Code market space\nArchitecting large scale Low Code application adopting Architecture Canvas, design process and validation, architecture patterns, application composition and style guide architecture\nExperience in providing Industry Solutions and share the Point of View with low code architecture\nHands on experience in creating Architecture Blueprint following three step architecture design process – Disclose, Organize and Assemble\nArchitecting Integration with external services following Integration Patterns for Core Services Abstraction\nExperience in developing Microservices and experience in Domain Driven Design with any low code application development platforms\nExperience in web technologies such as HTML, CSS, Java or .Net, XML, SOAP, JSON, SQL, Web Services\nExperience in Frameworks like Angular or React, .NET or Spring Frameworks\nWorking Experience in Data Modelling using Relational Databases\nResponsibilities on projects include system analysis, detailed systems design, system implementation with Lead Architect Responsibility. Worked closely with other Business areas experts.\nWorking with a project team and clients to develop formal design.\nDesign specifications and effort estimates\nDeveloping applications per design specifications.\nGood understanding of DevOps including any low code platforms and CI/CD pipeline Integration\nInculcate the culture of hackathons, Technical Events, etc., within the team.\nFocus on clear documentation of the architecture.\nDefinition and follow-up of Governance rules.\nCommunication and contribution on the evolution of security rules, as well as the defined application and technological architecture.\n\n\n\n\n📧 Apply now via LinkedIn Easy Apply or share your resume at pramod@intellistaff.in",
    "company_details": {
      "headquarters": null,
      "founded": null,
      "industry": null,
      "company_size": null
    }
  },
  {
    "job_title": "Founding Product Designer (Consumer AI)",
    "company": "Canvas AI",
    "company_url": "https://www.linkedin.com/company/canvasxai/life",
    "location": null,
    "posted_date": "India · 2 hours ago · 44 people clicked apply\n\nPromoted by hirer · Responses managed off LinkedIn",
    "applicant_count": null,
    "job_url": "https://www.linkedin.com/jobs/view/4360391597/",
    "description": "About the job",
    "company_details": {
      "headquarters": null,
      "founded": null,
      "industry": "Software Development",
      "company_size": "11-50 employees"
    }
  },
  {
    "job_title": "AI - Voice Specialist (English Dubbing)",
    "company": "Kuku FM",
    "company_url": "https://www.linkedin.com/company/kukufm/life",
    "location": null,
    "posted_date": "India · 2 hours ago · 20 applicants\n\nNo response insights available yet",
    "applicant_count": "India · 2 hours ago · 20 applicants\n\nNo response insights available yet",
    "job_url": "https://www.linkedin.com/jobs/view/4360881158/",
    "description": "About the job\n\nAbout The Role\n\nStorizz (Kuku FM) is initiating English dubbing for its original content using GenAI-driven voice and dubbing workflows.We are looking for a hands-on individual contributor who can execute English dubbing at scale-ready quality while helping establish a repeatable, efficient process. This role is execution-focused, with opportunities to take on greater ownership as the volume of content grows.\n\nKey Responsibilities\n\n\nProduce English dubbed audio for original content using AI voice and dubbing tools.\nEnsure audio quality meets defined standards for clarity, tone, pacing, and pronunciation.\nPerform quality checks on AI-generated output and make necessary refinements.\nCollaborate with internal teams to align on content priorities and delivery timelines.\nDocument workflows and contribute to the development of scalable dubbing processes and quality benchmarks.\n\n\nRequired Qualifications\n\n\nStrong proficiency in spoken and written English, with familiarity with US-market tone and delivery. \nExperience working with AI voice, text-to-speech, or dubbing tools, or demonstrated ability to learn and adapt quickly.\nGood audio judgment, with the ability to identify unnatural delivery, pacing issues, or pronunciation errors.\nDetail-oriented, execution-driven, and comfortable working independently.\n\n\nPreferred Qualifications\n\n\n2+ years prior experience in voice-over, dubbing, audio editing, or content localization\nFamiliarity with tools such as ElevenLabs, PlayHT, Azure TTS, Google TTS, or similar platforms.\nExposure to US-focused digital content, OTT platforms, or short-form storytelling formats.\n\n\nSuccess Metrics\n\n\nConsistent delivery of high-quality English dubs within defined timelines.\nImprovement in naturalness and consistency of output over time.\nDevelopment of clear workflows that support increased content volume.\nSmooth handoff and reproducibility of the dubbing process.\n\n\nWhy Join Storizz (Kuku FM)\n\nOpportunity to work at the intersection of AI, storytelling, and media localization.\n\nHigh ownership role with visibility into how content scales globally.\n\n\nPotential to grow into a Localization or Dubbing Operations Lead role as the pipeline matures.\n\n\nSkills: artificial intelligence,storytelling,elevanlabs,audio editing,english dubbing,text to speech,localization,dubbing tools,dubbing,ai voice,english,tts,ai dubbing",
    "company_details": {
      "headquarters": null,
      "founded": null,
      "industry": null,
      "company_size": "51-200 employees"
    }
  },
  {
    "job_title": "UI / UX Designer",
    "company": "Job Nexus India",
    "company_url": "https://www.linkedin.com/company/jobnexusindiadotcom/life",
    "location": null,
    "posted_date": "India · 6 hours ago · Over 100 people clicked apply\n\nPromoted by hirer · Responses managed off LinkedIn",
    "applicant_count": null,
    "job_url": "https://www.linkedin.com/jobs/view/4353883349/",
    "description": "About the job\n\nJob Title: UI / UX Designer\n\nCompany Name: Wikasta Business and Technical Solutions Pvt. Ltd.\n\nEmployment Type: Full-Time\n\nWork Mode: Work From Home\n\nWorking Days: 5 Days per Week\n\nSalary Range: ₹2,40,000 – ₹4,80,000 per year\n\n\n\n\nAbout the Opportunity\n\nJob Nexus India is hiring a UI / UX Designer for one of its client organisations. This role is suited for professionals who have a strong eye for design, a user-first mindset, and experience designing intuitive, scalable product experiences, particularly in SaaS environments.\n\n\n\n\nRole Overview\n\nThe UI / UX Designer will be responsible for translating complex product and business requirements into clear, intuitive, and engaging user experiences. The role involves owning the complete design lifecycle and collaborating closely with product, engineering, and leadership teams.\n\n\n\n\nKey Responsibilities\n\nTranslate product and business requirements into intuitive user experiences\nOwn the end-to-end design process, from user flows and wireframes to high-fidelity designs and interactive prototypes\nDesign, maintain, and scale design systems in Figma to ensure consistency across the product\nCollaborate closely with product managers, founders, and engineers to define and refine product experiences\nConduct user research, usability testing, and design validation, and iterate based on insights\nDesign experiences optimized for SaaS workflows, dashboards, and complex user journeys\nWork in an agile, feedback-driven environment and iterate on designs quickly\nEnsure designs meet accessibility, usability, and modern UI standards\nStay updated with UI/UX trends, tools, and best practices\n\n\n\n\nEligibility & Requirements\n\nStrong proficiency in Figma, including components, auto-layout, variants, design systems, and prototyping\nProven experience designing SaaS-based products (B2B or B2C)\nPrior experience working with startups or early-stage companies\nStrong understanding of UX principles, usability, information architecture, and interaction design\nAbility to balance user needs, business goals, and technical constraints\nExcellent visual design skills with strong attention to detail and consistency\nAbility to work independently and take ownership of design decisions\nA strong portfolio demonstrating product and SaaS design work\n\n\n\n\nAbout Job Nexus India\n\nJob Nexus India is a staffing and recruitment firm that supports organisations by managing their hiring requirements. We work with client companies to identify suitable candidates and facilitate a structured and transparent recruitment process.",
    "company_details": {
      "headquarters": null,
      "founded": null,
      "industry": null,
      "company_size": "0-1 employees"
    }
  },
  {
    "job_title": "AI Research Engineer - Reinforcement Learning (100% Remote)",
    "company": "Tether.io",
    "company_url": "https://www.linkedin.com/company/tether/life",
    "location": null,
    "posted_date": "India · 10 hours ago · 27 people clicked apply\n\nResponses managed off LinkedIn",
    "applicant_count": null,
    "job_url": "https://www.linkedin.com/jobs/view/4364360000/",
    "description": "About the job\n\nJoin Tether and Shape the Future of Digital Finance\n\nAt Tether, we’re not just building products, we’re pioneering a global financial revolution. Our cutting-edge solutions empower businesses—from exchanges and wallets to payment processors and ATMs—to seamlessly integrate reserve-backed tokens across blockchains. By harnessing the power of blockchain technology, Tether enables you to store, send, and receive digital tokens instantly, securely, and globally, all at a fraction of the cost. Transparency is the bedrock of everything we do, ensuring trust in every transaction.\n\nInnovate with Tether\n\nTether Finance: Our innovative product suite features the world’s most trusted stablecoin, USDT, relied upon by hundreds of millions worldwide, alongside pioneering digital asset tokenization services.\n\nBut that’s just the beginning:\n\nTether Power: Driving sustainable growth, our energy solutions optimize excess power for Bitcoin mining using eco-friendly practices in state-of-the-art, geo-diverse facilities.\n\nTether Data: Fueling breakthroughs in AI and peer-to-peer technology, we reduce infrastructure costs and enhance global communications with cutting-edge solutions like KEET, our flagship app that redefines secure and private data sharing.\n\nTether Education: Democratizing access to top-tier digital learning, we empower individuals to thrive in the digital and gig economies, driving global growth and opportunity.\n\nTether Evolution: At the intersection of technology and human potential, we are pushing the boundaries of what is possible, crafting a future where innovation and human capabilities merge in powerful, unprecedented ways.\n\nWhy Join Us?\n\nOur team is a global talent powerhouse, working remotely from every corner of the world. If you’re passionate about making a mark in the fintech space, this is your opportunity to collaborate with some of the brightest minds, pushing boundaries and setting new standards. We’ve grown fast, stayed lean, and secured our place as a leader in the industry.\n\nIf you have excellent English communication skills and are ready to contribute to the most innovative platform on the planet, Tether is the place for you.\n\nAre you ready to be part of the future?\n\nAbout The Job\n\nAs a member of the AI model team, you will drive innovation in reinforcement learning approaches for advanced models. Your work will optimize decision-making and adaptive behavior to deliver enhanced intelligence, improved performance, and domain-specific capabilities for real-world challenges. You will work across a broad spectrum of systems, including resource-efficient models designed for limited hardware environments and complex multi-modal architectures that integrate data such as text, images, and audio.\n\nWe expect you to have deep expertise in designing reinforcement learning systems and a strong background in advanced model architectures. You will adopt a hands-on, research-driven approach to developing, testing, and implementing novel reinforcement learning algorithms and training frameworks. Your responsibilities include curating specialized simulation environments and training datasets, strengthening baseline policy performance, and identifying as well as resolving bottlenecks in the reinforcement learning process. The ultimate goal is to unlock superior, domain-adapted AI performance and push the limits of what these models can achieve in dynamic, real-world environments.\n\nResponsibilities\n\n\nDevelop and implement state-of-the-art reinforcement learning algorithms designed to optimize decision-making processes in both simulated and real-world settings. Establish clear performance targets such as reward maximization and policy stability.\nBuild, run, and monitor controlled reinforcement learning experiments. Track key performance indicators while documenting iterative results and comparing outcomes against established benchmarks.\nIdentify and curate high-quality simulation environments and training datasets that are tailored to specific domain challenges. Set measurable criteria to ensure that the selection and preparation of these resources significantly enhance the learning process and overall model performance.\nSystematically debug and optimize the reinforcement learning pipeline by analyzing both computational efficiency and learning performance metrics. Address issues such as reward signal noise, exploration strategy, and policy divergence to improve convergence and stability.\nCollaborate with cross-functional teams to integrate reinforcement learning agents into production systems. Define clear success metrics such as real-world performance improvements and robustness under varied conditions and ensure continuous monitoring and iterative refinements for sustained domain adaptation.\nA degree in Computer Science or related field. Ideally PhD in NLP, Machine Learning, or a related field, complemented by a solid track record in AI R&D (with good publications in A* conferences).\nProven experience with large-scale reinforcement learning experiments, including online RL techniques such as Group Relative Policy Optimization (GRPO), is essential. Your contributions should have led to measurable improvements in domain-specific decision-making and overall policy performance.\nDeep understanding of reinforcement learning algorithms is required, including state-of-the-art online RL methods and other gradient-based optimization approaches like policy gradients, actor-critic, and GRPO. Your expertise should emphasize enhancing policy stability, exploration, and sample efficiency in complex, dynamic environments.\nStrong expertise in PyTorch and relevant reinforcement learning frameworks is a must. Practical experience in developing RL pipelines, from simulation and online training to post-training evaluation and deploying RL-based solutions in production environments is expected.\nDemonstrated ability to apply empirical research to overcome reinforcement learning challenges such as sample inefficiency, exploration-exploitation tradeoffs, and training instability. You should be proficient in designing robust evaluation frameworks and iterating on algorithmic innovations to continuously push the boundaries of RL agent performance.\n\n\nImportant information for candidates\n\nRecruitment scams have become increasingly common. To protect yourself, please keep the following in mind when applying for roles:\n\n\nApply only through our official channels. We do not use third-party platforms or agencies for recruitment unless clearly stated. All open roles are listed on our official careers page: https://tether.recruitee.com/\nVerify the recruiter’s identity. All our recruiters have verified LinkedIn profiles. If you’re unsure, you can confirm their identity by checking their profile or contacting us through our website.\nBe cautious of unusual communication methods. We do not conduct interviews over WhatsApp, Telegram, or SMS. All communication is done through official company emails and platforms.\nDouble-check email addresses. All communication from us will come from emails ending in @tether.to or @tether.io\nWe will never request payment or financial details. If someone asks for personal financial information or payment at any point during the hiring process, it is a scam. Please report it immediately.\n\n\nWhen in doubt, feel free to reach out through our official website.",
    "company_details": {
      "headquarters": null,
      "founded": null,
      "industry": "Financial Services",
      "company_size": "201-500 employees"
    }
  }
]