[
  {
    "job_title": "Data Partner- Math- Japanese - Remote- Global",
    "company": "TELUS Digital",
    "company_url": "https://www.linkedin.com/company/telus-digital/life",
    "location": null,
    "posted_date": "APAC · 36 minutes ago · 0 people clicked apply\n\nPromoted by hirer · Responses managed off LinkedIn",
    "applicant_count": "All qualified applicants will receive consideration for a contractual relationship without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or protected veteran status. At TELUS Digital AI, we are proud to offer equal opportunities and are committed to creating a diverse and inclusive community. All aspects of selection are based on applicants’ qualifications, merits, competence, and performance without regard to any characteristic related to diversity",
    "job_url": "https://www.linkedin.com/jobs/view/4364261844/",
    "description": "About the job\n\nLocation: Global - Remote\n\n\n\n\nAre you ready to use your domain knowledge to advance AI? Join us as a Data Partner and work remotely with flexible hours. We are seeking highly knowledgeable Subject Matter Expert to design advanced, domain-specific questions and solutions. The role involves creating challenging problem sets that test deep reasoning and expertise in the assigned field.\n\n\n\n\nTELUS Digital AI Community\n\nOur global AI Community is a vibrant network of 1 million+ contributors from diverse backgrounds who help our customers collect, enhance, train, translate, and localize content to build better AI models. Become part of our growing community and make an impact supporting the machine learning models of some of the world’s largest brands.\n\n\n\n\nKey Responsibilities:\n\nDevelop complex, original question-and-answer pairs based on advanced topics in your area of expertise.\nEnsure questions involve multi-step problem-solving and critical thinking.\nProvide detailed, clear solutions that meet high academic standards.\nCollaborate with cross-functional teams to refine and enhance content.\n\n\n\n\nQualification path\n\n\n\n\nBasic Requirements:\n\nA completed Master, Bachelor or local equivalent in Math is essential\nStrong proficiency in Japanese writing with excellent grammar, clarity, and the ability to explain complex concepts concisely\n\n\n\n\nAssessment:\n\nIn order to be hired into our community, you’ll go through a subject-specific qualification exam that will determine your suitability for the position and complete ID verification.\n\n\n\n\nPayment:\n\nCurrently, pay rates for experts range from $20 - $30 USD per hour\nOur Payment terms are defined for each project.\n\n\n\n\nEqual Opportunity:\n\nAll qualified applicants will receive consideration for a contractual relationship without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or protected veteran status. At TELUS Digital AI, we are proud to offer equal opportunities and are committed to creating a diverse and inclusive community. All aspects of selection are based on applicants’ qualifications, merits, competence, and performance without regard to any characteristic related to diversity",
    "company_details": {
      "headquarters": null,
      "founded": null,
      "industry": "IT Services and IT Consulting",
      "company_size": "10K+ employees"
    }
  },
  {
    "job_title": "User Experience Designer",
    "company": "VectorShift",
    "company_url": "https://www.linkedin.com/company/vectorshift/life",
    "location": null,
    "posted_date": "India · 1 hour ago · Over 100 applicants\n\nPromoted by hirer · No response insights available yet",
    "applicant_count": "India · 1 hour ago · Over 100 applicants\n\nPromoted by hirer · No response insights available yet",
    "job_url": "https://www.linkedin.com/jobs/view/4360841680/",
    "description": "About the job\n\nYou will partner closely with our founders and engineering team to own the design function at VectorShift. This is a hybrid role for a versatile designer who loves variety: one day you might be solving a complex UX problem for our workflow builder, and the next you might be build chat experiences from our 100k+ users.\n\n\n\n\nYou aren’t just \"making things pretty\"—you are translating abstract AI logic into an intuitive, powerful interface that feels magical to use.\n\n\n\n\nWhat You’ll Do:\n\nProduct Experience (The Core)\n\nOwn the detailed UX/UI: Lead end-to-end design for VectorShift’s core features, including our no-code pipeline builder, node logic, and data integrations.\nSimplify Complexity: Take complex technical concepts (variables, loops, LLM chains) and turn them into simple, drag-and-drop interfaces that non-engineers can understand.\nShip Real Software: Deliver high-fidelity Figma mocks and prototypes that are ready for engineering. Work side-by-side with devs to ensure the final build matches the design specs.\nBuilding Delightful Experiences: build end user experiences that make the users come back over and over again\n\n\n\n\nWho You Are\n\n1+ Years Experience: You have a strong background in Product Design, ideally at a SaaS, DevTool, or Productivity startup.\nPortfolio that shows \"Logic\": You can share a portfolio that goes beyond pretty pictures. We want to see Case Studies that explain how you solved a difficult problem, from wireframe to final pixel.\nFigma Master: You are fast and efficient in Figma. You know how to use auto-layout and components to keep files organized.\nTechnical Aptitude: You don't need to code, but you understand how software is built. You can speak the language of engineers and understand constraints.\nScrappy & Fast: You are comfortable with the \"mess\" of a startup. You don't need a 30-page brief to get started; you ask questions and iterate quickly.\n\n\n\n\nWhy Join VectorShift\n\nHigh Ownership: You are not a cog in a machine. You are the design voice of the company.\nCategory Creation: You are helping define the UI/UX for the emerging field of AI automation.\nDirect Impact: Your work will be shipped to thousands of users immediately. No red tape.",
    "company_details": {
      "headquarters": null,
      "founded": null,
      "industry": "Technology, Information and Internet",
      "company_size": "2-10 employees"
    }
  },
  {
    "job_title": "Senior UI/UX Designer - REMOTE",
    "company": "Jobgether",
    "company_url": "https://www.linkedin.com/company/jobgether/life",
    "location": null,
    "posted_date": "India · 1 hour ago · 24 people clicked apply\n\nResponses managed off LinkedIn",
    "applicant_count": "Be an early applicant",
    "job_url": "https://www.linkedin.com/jobs/view/4364081558/",
    "description": "About the job\n\nThis position is posted by Jobgether on behalf of a partner company. We are currently looking for a Principal Product Designer - REMOTE. In this role, you will have the unique opportunity to shape the design direction of innovative products that enhance customer experiences. By elevating design practices and leveraging AI-powered solutions, your work will significantly impact product evolution and user satisfaction. As a senior individual contributor, you will influence cross-functional teams and help bridge the gap between product vision and execution. Your expertise will be vital in driving high-quality design outcomes and fostering an environment of creative collaboration. This role offers you the chance to bring your vast experience to lead complex design challenges in a dynamic setting.\n\nAccountabilities\n\n\nTranslate product and company vision into opinionated, future-forward design direction across major product areas\nThink beyond near-term delivery to explore long-term opportunities, using concepts and prototypes to shape product evolution\nDefine and champion design principles and systems that support enterprise-ready, AI-forward experiences\nLead complex, ambiguous design problems end-to-end, from framing and exploration through execution and refinement\nPartner deeply with Product, Engineering, and GTM to influence roadmaps and strategic decisions\nUse customer research, product data, and insight to inform decisions while applying strong independent judgment\nRaise the bar for design quality through critique, mentorship, and design leadership without people management\n\n\nRequirements\n\n\n8+ years of product design experience, ideally with B2B SaaS, platforms, or complex products\nDemonstrated experience designing AI-enabled products, automation, or intelligent workflows\nStrong prototyping skills used for vision-setting and alignment\nProven ability to take abstract product vision and turn it into a cohesive design vision\nStrong systems thinker with experience designing for scale, extensibility, and long-term impact\nExceptional craft paired with strategic thinking and comfort operating in ambiguity\nTrack record of influencing cross-functional partners and driving alignment\nExperience mentoring designers and elevating team practices through example\nComfort collaborating closely with front-end engineers and understanding technical constraints\nA strong point of view grounded in user outcomes and business impact\n\n\nBenefits\n\n\n100% remote - All employees learn and collaborate using remote work practices\nSolid health, dental, and vision plans; access to 401k (with a match), and generous parental leave\nOne-time $1000 home office stipend and an additional $500 annual budget for extra work-related technology\nMonthly co-working space fees reimbursement available\nEquity granted to every employee, investing everyone in our success\nTeam alignment through various meetings, newsletters, and annual learning stipends\nFlexible Time Off policy allowing employees to schedule time off when needed\n\n\nWhy Apply Through Jobgether?\n\nWe use an AI-powered matching process to ensure your application is reviewed quickly, objectively, and fairly against the role's core requirements. Our system identifies the top-fitting candidates, and this shortlist is then shared directly with the hiring company. The final decision and next steps (interviews, assessments) are managed by their internal team.\n\nWe appreciate your interest and wish you the best!\n\nData Privacy Notice: By submitting your application, you acknowledge that Jobgether will process your personal data to evaluate your candidacy and share relevant information with the hiring employer. This processing is based on legitimate interest and pre-contractual measures under applicable data protection laws (including GDPR). You may exercise your rights (access, rectification, erasure, objection) at any time.\n\nWe may use artificial intelligence (AI) tools to support parts of the hiring process, such as reviewing applications, analyzing resumes, or assessing responses. These tools assist our recruitment team but do not replace human judgment. Final hiring decisions are ultimately made by humans. If you would like more information about how your data is processed, please contact us.",
    "company_details": {
      "headquarters": null,
      "founded": null,
      "industry": null,
      "company_size": "11-50 employees"
    }
  },
  {
    "job_title": "Mendix Architect",
    "company": "Intellistaff Services Pvt. Ltd",
    "company_url": "https://www.linkedin.com/company/intellistaff-services-pvt-ltd/life",
    "location": null,
    "posted_date": "Hyderabad, Telangana, India · 2 hours ago · 10 applicants\n\nPromoted by hirer · No response insights available yet",
    "applicant_count": "Hyderabad, Telangana, India · 2 hours ago · 10 applicants\n\nPromoted by hirer · No response insights available yet",
    "job_url": "https://www.linkedin.com/jobs/view/4353784275/",
    "description": "About the job\n\nPosition name: Mendix-Architect\n\nlocation: Anywhere in India\n\nyrs of exp: 12 years (5 YEARS IN Mendix) \n\nNotice Period: Immediate Joiners to 60 Days NP\n\nshift timings: 2 – 11 PM\n\nMandatory skills\n\nMinimum five years of relevant Solution Architecture/lead experience with a good understanding of the aPaaS/PaaS and Low Code No Code market space\nArchitecting large scale Low Code application adopting Architecture Canvas, design process and validation, architecture patterns, application composition and style guide architecture\nExperience in providing Industry Solutions and share the Point of View with low code architecture\nHands on experience in creating Architecture Blueprint following three step architecture design process – Disclose, Organize and Assemble\nArchitecting Integration with external services following Integration Patterns for Core Services Abstraction\nExperience in developing Microservices and experience in Domain Driven Design with any low code application development platforms\nExperience in web technologies such as HTML, CSS, Java or .Net, XML, SOAP, JSON, SQL, Web Services\nExperience in Frameworks like Angular or React, .NET or Spring Frameworks\nWorking Experience in Data Modelling using Relational Databases\nResponsibilities on projects include system analysis, detailed systems design, system implementation with Lead Architect Responsibility. Worked closely with other Business areas experts.\nWorking with a project team and clients to develop formal design.\nDesign specifications and effort estimates\nDeveloping applications per design specifications.\nGood understanding of DevOps including any low code platforms and CI/CD pipeline Integration\nInculcate the culture of hackathons, Technical Events, etc., within the team.\nFocus on clear documentation of the architecture.\nDefinition and follow-up of Governance rules.\nCommunication and contribution on the evolution of security rules, as well as the defined application and technological architecture.\n\n\n\n\n📧 Apply now via LinkedIn Easy Apply or share your resume at pramod@intellistaff.in",
    "company_details": {
      "headquarters": null,
      "founded": null,
      "industry": "IT Services and IT Consulting",
      "company_size": "11-50 employees"
    }
  },
  {
    "job_title": "Founding Product Designer (Consumer AI)",
    "company": "Canvas AI",
    "company_url": "https://www.linkedin.com/company/canvasxai/life",
    "location": null,
    "posted_date": "India · 3 hours ago · 56 people clicked apply\n\nPromoted by hirer · Responses managed off LinkedIn",
    "applicant_count": null,
    "job_url": "https://www.linkedin.com/jobs/view/4360391597/",
    "description": "About the job\n\nHiring Partner: Canvas Labs (on behalf of a Stealth Startup)\n\nLocation: Remote\n\nExperience: 4-6 Years\n\nCompensation: ₹24 - 30 LPA\n\n\n\n\nThe Short Story\n\nWe are Canvas Labs, we are helping build the founding tech team for a stealth startup that is set to disrupt the Consumer AI space.\n\nBefore I continue just a little bit about the team, Ex–IIT Delhi, leading strategy and engineering at world-class firms. And now they’re coming together—Avengers-style—to build the next big category defining product.\n\nWe can’t tell you exactly what we are building yet (shhh), but we can tell you this: It is a mobile-first product designed to bring the power of Generative AI into the daily lives of consumers in a way that feels like magic, not just \"tech.\"\n\nWe are looking for a Product Designer who is obsessed with Mobile UX, loves the chaos of 0-to-1 building, and wants to design interfaces for intelligence, not just data.\n\n\n\n\nThe Mission\n\nMost AI products today feel like \"tools.\" We want to build a \"companion.\"\n\nWe are moving beyond simple chatbots. We are designing a consumer experience that anticipates needs and simplifies complex workflows. Your job is to make the sophisticated AI backend feel invisible, intuitive, and delightful on a mobile screen.\n\n\n\n\nWhat You’ll Do (The 0 to 1 Journey)\n\nOwn the Mobile Experience: This is a hard requirement. You aren’t shrinking a desktop site to mobile; you are designing natively for iOS/Android. You think in gestures, haptics, thumb zones, and bottom sheets.\nDefine AI Interaction Patterns: How does a user interact with an AI that \"thinks\"? You will design the affordances, loading states, and feedback loops that build trust between the human and the AI.\nPrototype at Warp Speed: In the early days, speed is survival. You will turn abstract ideas into tangible wireframes and high-fidelity prototypes (Figma) to test hypotheses with the founders.\nCollaborate with the Best: You will work directly with founders who have scaled products and strategies at the highest levels. You will need to defend your design decisions with logic and user empathy.\n\n\n\n\nWho You Are\n\nThe Experience: You have 3-6 years of product design experience, with a heavy portfolio focus on Mobile Consumer Apps. (SaaS dashboards are great, but we need someone who understands consumer psychology).\nThe Tooling: You breathe Figma. You are organized with your design systems but flexible enough to break the rules when innovation requires it.\nThe \"AI\" Curiosity: You don’t just design static screens; you are curious about how GenAI works and how to design for dynamic content.\nThe Mindset: You are comfortable with ambiguity. \"Stealth mode\" means requirements change, pivots happen, and you need to be resilient and adaptable.\n\n\n\n\nWhy You Should Join\n\nThe Pedigree: Work alongside alumni from IIT Delhi, from top notch consulting and tech firms. This is a masterclass in high-performance execution.\nThe Impact: You are not Employee #500. You are a founding designer. Your fingerprints will be on the DNA of this product forever.\nThe Compensation: We value top talent. Offering a competitive range of ₹24 - 30 LPA.\n\n\n\n\nThe Selection Process\n\nWe know talented designers are busy. We’ve designed a streamlined process that respects your time while allowing your skills to shine.\n\nApplication & The \"Sprint\": Fill out the form. Along with attaching your CV and Portfolio, the form includes a rapid-fire Product Critique: The Perplexity Deep-Dive: Spend some time with the Perplexity mobile app. Identify three specific UX improvements or feature additions that would significantly enhance its stickiness or usability as a daily companion.We aren't looking for visual nitpicks; we want to see how you think about interaction models and user psychology. Submit 3 concise bullet points only.\nPortfolio Walkthrough and : Show what you have done and be ready for some grilling :) \nThe Discussion: Deep dive interview with the founders.\n\n\n\n\nReady to build the future of Consumer AI?",
    "company_details": {
      "headquarters": null,
      "founded": null,
      "industry": "Software Development",
      "company_size": "11-50 employees"
    }
  },
  {
    "job_title": "UI / UX Designer",
    "company": "Job Nexus India",
    "company_url": "https://www.linkedin.com/company/jobnexusindiadotcom/life",
    "location": null,
    "posted_date": "India · 7 hours ago · Over 100 people clicked apply\n\nPromoted by hirer · Responses managed off LinkedIn",
    "applicant_count": null,
    "job_url": "https://www.linkedin.com/jobs/view/4353883349/",
    "description": "About the job\n\nJob Title: UI / UX Designer\n\nCompany Name: Wikasta Business and Technical Solutions Pvt. Ltd.\n\nEmployment Type: Full-Time\n\nWork Mode: Work From Home\n\nWorking Days: 5 Days per Week\n\nSalary Range: ₹2,40,000 – ₹4,80,000 per year\n\n\n\n\nAbout the Opportunity\n\nJob Nexus India is hiring a UI / UX Designer for one of its client organisations. This role is suited for professionals who have a strong eye for design, a user-first mindset, and experience designing intuitive, scalable product experiences, particularly in SaaS environments.\n\n\n\n\nRole Overview\n\nThe UI / UX Designer will be responsible for translating complex product and business requirements into clear, intuitive, and engaging user experiences. The role involves owning the complete design lifecycle and collaborating closely with product, engineering, and leadership teams.\n\n\n\n\nKey Responsibilities\n\nTranslate product and business requirements into intuitive user experiences\nOwn the end-to-end design process, from user flows and wireframes to high-fidelity designs and interactive prototypes\nDesign, maintain, and scale design systems in Figma to ensure consistency across the product\nCollaborate closely with product managers, founders, and engineers to define and refine product experiences\nConduct user research, usability testing, and design validation, and iterate based on insights\nDesign experiences optimized for SaaS workflows, dashboards, and complex user journeys\nWork in an agile, feedback-driven environment and iterate on designs quickly\nEnsure designs meet accessibility, usability, and modern UI standards\nStay updated with UI/UX trends, tools, and best practices\n\n\n\n\nEligibility & Requirements\n\nStrong proficiency in Figma, including components, auto-layout, variants, design systems, and prototyping\nProven experience designing SaaS-based products (B2B or B2C)\nPrior experience working with startups or early-stage companies\nStrong understanding of UX principles, usability, information architecture, and interaction design\nAbility to balance user needs, business goals, and technical constraints\nExcellent visual design skills with strong attention to detail and consistency\nAbility to work independently and take ownership of design decisions\nA strong portfolio demonstrating product and SaaS design work\n\n\n\n\nAbout Job Nexus India\n\nJob Nexus India is a staffing and recruitment firm that supports organisations by managing their hiring requirements. We work with client companies to identify suitable candidates and facilitate a structured and transparent recruitment process.",
    "company_details": {
      "headquarters": null,
      "founded": null,
      "industry": null,
      "company_size": "0-1 employees"
    }
  },
  {
    "job_title": "Freelance Graphic Designer",
    "company": "MTechZilla",
    "company_url": "https://www.linkedin.com/company/mtechzilla/life",
    "location": null,
    "posted_date": "India · 15 hours ago · 27 applicants\n\nNo response insights available yet",
    "applicant_count": "India · 15 hours ago · 27 applicants\n\nNo response insights available yet",
    "job_url": "https://www.linkedin.com/jobs/view/4360831707/",
    "description": "About the job\n\nThis is a remote position.\n\nJob Overview\n\n\nWe are looking for a talented and creative Freelance Graphic Designer to join our dynamic team and bring our brand vision to life through compelling visual content. You will be responsible for creating engaging designs across multiple platforms, from digital marketing materials to motion graphics and video content. The ideal candidate will have a strong portfolio showcasing diverse design work and the ability to translate complex ideas into visually stunning designs that resonate with our target audience.\n\n\nKey Responsibilities\n\n\nCreate visually compelling graphics for digital and print media including social media posts, website banners, marketing collateral, presentations, and brand materials.\n\nDesign and develop motion graphics, animated content, and video assets for social media campaigns, promotional videos, and digital advertising.\n\nEdit and produce video content including corporate videos, product demos, testimonials, and social media reels, with attention to pacing, transitions, and visual storytelling.\n\nCollaborate with marketing, content, and product teams to understand project requirements and deliver designs that align with brand guidelines and campaign objectives.\n\nDevelop creative concepts and design solutions that effectively communicate key messages and drive engagement across multiple channels.\n\nMaintain brand consistency across all design assets while bringing fresh, innovative ideas to evolve our visual identity.\n\nManage multiple projects simultaneously, meeting deadlines and maintaining high-quality standards under tight timelines.\n\nStay updated with the latest design trends, tools, and technologies in graphic design, motion graphics, and video production.\n\nIncorporate feedback from stakeholders efficiently and iterate on designs to achieve optimal results.\n\nPrepare and optimise design files for various output formats including web, mobile, print, and social media platforms.\n\nWork independently with minimal supervision while maintaining clear communication with team members and stakeholders.\n\n \n \n\nRequirements\n\n\n5+ years of professional experience in graphic design, with a strong portfolio demonstrating expertise in both static and motion graphics.\n\nExpert proficiency in Adobe Creative Suite (Photoshop, Illustrator, InDesign, After Effects, Premiere Pro).\n\nStrong proficiency in Affinity Designer, Affinity Photo, and Affinity Publisher.\n\nDemonstrated expertise in 2D motion graphics design and animation using Adobe After Effects.\n\nProficiency in 3D motion graphics software (Cinema 4D, Blender, or similar tools) for creating three dimensional animated content.\n\nProficient in video editing software including Adobe Premiere Pro, Final Cut Pro, or DaVinci Resolve.\n\nStrong understanding of design principles including typography, colour theory, composition, and visual hierarchy.\n\nExperience creating content optimised for various social media platforms (Instagram, Link:edln, Facebook, YouTube, etc.).\n\nAbility to work with brand guidelines while bringing creative innovation to design projects.\n\nExcellent time management skills with the ability to handle multiple projects and meet deadlines consistently.\n\nStrong communication skills and ability to present and explain design concepts effectively.\n\nSelf-motivated with the ability to work independently in a remote/freelance capacity.\n\nUnderstanding of current design trends, digital marketing best practices, and platform-specific requirements.\n\n\nNice to have:\n\n\nExperience in photography and photo retouching.\n\nKnowledge of sound design and audio editing for video projects.\n\nExperience working with startups or fast-paced digital marketing agencies.\n\nUnderstanding of SEO and content marketing principles as they relate to visual content.\n\nExperience with print production processes and preparing print-ready files.\n\nFamiliarity with illustration techniques and digital painting.\n\n \n \n\nBenefits\n\n\n\nWhat We Offer\n\n\nCompetitive freelance rates aligned with experience and project scope.\n\nFlexible working hours and fully remote work arrangement.\n\nOpportunity to work on diverse projects across multiple industries and creative challenges.\n\nCollaborative team environment with creative freedom and support.\n\nPotential for long-term partnership and consistent project flow.\n\nAccess to professional development resources and the design community.\n\nExposure to international brands and cutting-edge design projects.\n\n\n\n\nDesired Skills and Experience\n\n5+ years of professional experience in graphic design, with a strong portfolio demonstrating expertise in both static and motion graphics. Expert proficiency in Adobe Creative Suite (Photoshop, Illustrator, InDesign, After Effects, Premiere Pro). Strong proficiency in Affinity Designer, Affinity Photo, and Affinity Publisher. Demonstrated expertise in 2D motion graphics design and animation using Adobe After Effects. Proficiency in 3D motion graphics software (Cinema 4D, Blender, or similar tools) for creating three dimensional animated content. Proficient in video editing software including Adobe Premiere Pro, Final Cut Pro, or DaVinci Resolve. Strong understanding of design principles including typography, colour theory, composition, and visual hierarchy. Experience creating content optimised for various social media platforms (Instagram, Link:edln, Facebook, YouTube, etc.). Ability to work with brand guidelines while bringing creative innovation to design projects. Excellent time management skills with the ability to handle multiple projects and meet deadlines consistently. Strong communication skills and ability to present and explain design concepts effectively. Self-motivated with the ability to work independently in a remote/freelance capacity. Understanding of current design trends, digital marketing best practices, and platform-specific requirements. Nice to have: Experience in photography and photo retouching. Knowledge of sound design and audio editing for video projects. Experience working with startups or fast-paced digital marketing agencies. Understanding of SEO and content marketing principles as they relate to visual content. Experience with print production processes and preparing print-ready files. Familiarity with illustration techniques and digital painting.",
    "company_details": {
      "headquarters": null,
      "founded": null,
      "industry": "IT Services and IT Consulting",
      "company_size": "11-50 employees"
    }
  },
  {
    "job_title": "Japanese Language Expert",
    "company": "micro1",
    "company_url": "https://www.linkedin.com/company/micro1/life",
    "location": null,
    "posted_date": "APAC · 15 hours ago · 17 people clicked apply\n\nPromoted by hirer · Responses managed off LinkedIn",
    "applicant_count": null,
    "job_url": "https://www.linkedin.com/jobs/view/4363779760/",
    "description": "About the job\n\nJob Title: Japanese Language Expert\n\nLocation: Remote\n\nContract Type: Full-time | Contract-based\n\n\n\n\nJob Description\n\nmicro1 is hiring a Japanese Language Expert to support advanced AI language model development for a global technology client. In this role, you will work on training, evaluating, and improving AI-generated content by applying your linguistic expertise in Japanese and English.\n\n\n\n\nKey Responsibilities\n\nAnnotate and review bilingual Japanese–English language data\nEvaluate text for grammatical accuracy, semantic clarity, and cultural relevance\nReview and improve AI-generated content to ensure natural language quality\nProvide detailed linguistic feedback to improve AI model outputs\nFollow annotation and quality guidelines while meeting productivity targets\nDocument findings and collaborate with internal teams as required\n\n\n\n\nRequired Skills & Qualifications\n\nNative or near-native proficiency in Japanese with strong English skills\nExperience in linguistics, data annotation, writing, editing, or language QA\nStrong understanding of Japanese and English grammar and cultural nuances\nExcellent attention to detail and communication skills\nAbility to work independently in a fully remote environment\nInterest in AI, NLP, and language technology",
    "company_details": {
      "headquarters": null,
      "founded": null,
      "industry": "Software Development",
      "company_size": "51-200 employees"
    }
  },
  {
    "job_title": "Mandarin Language Expert",
    "company": "micro1",
    "company_url": "https://www.linkedin.com/company/micro1/life",
    "location": null,
    "posted_date": "APAC · 16 hours ago · 29 people clicked apply\n\nPromoted by hirer · Responses managed off LinkedIn",
    "applicant_count": null,
    "job_url": "https://www.linkedin.com/jobs/view/4363759496/",
    "description": "About the job\n\nJob Title: Mandarin Language - Expert\n\n\n\n\nJob Type: Full-time\n\n\n\n\nLocation: Remote\n\n\n\n\nJob Summary:\n\nJoin our customer’s team as a Mandarin Language Expert and play an essential role in supporting high-impact global language projects—all from the comfort of your remote workspace. Leverage your mastery of Mandarin Chinese to ensure exceptional linguistic accuracy, cultural authenticity, and clear communication. This is an ideal opportunity for dedicated linguists who excel in international collaboration and value both written and verbal communication.\n\n\n\n\nKey Responsibilities:\n\nTranslate, proofread, and edit content accurately between Mandarin and English, maintaining cultural relevance and nuance.\nCollaborate with cross-functional teams to deliver expert language support for web content, marketing materials, and user communications.\nConduct thorough linguistic reviews and offer actionable feedback to enhance clarity, tone, and consistency.\nEnsure content aligns with brand voice, style, and stringent quality standards.\nContribute to the ongoing development and maintenance of glossaries and linguistic resources.\nProvide insights on cultural and linguistic nuances to maximize local market relevance.\nActively participate in remote meetings, sharing expertise and contributing to project strategies.\n\n\n\n\nRequired Skills and Qualifications:\n\nNative-level fluency in Mandarin Chinese, paired with outstanding grammar, spelling, and stylistic precision.\nExceptional written and verbal communication skills in both Mandarin and English.\nProven experience in translation, localization, linguistics, or related language fields.\nAbility to work independently and manage multiple priorities in a fully remote environment.\nKeen attention to detail and unwavering commitment to linguistic quality.\nComfort and proficiency with digital tools, platforms, and collaborative technologies.\n\n\n\n\nPreferred Qualifications:\n\nBachelor’s degree or higher in Linguistics, Translation, Chinese Language, or a related discipline.\nPrevious experience with international or multicultural language projects.\nFamiliarity with translation tools, QA workflows, or language technology platforms.",
    "company_details": {
      "headquarters": null,
      "founded": null,
      "industry": "Software Development",
      "company_size": "51-200 employees"
    }
  },
  {
    "job_title": "Junior UX Designer",
    "company": "Pendamaze Studio",
    "company_url": "https://www.linkedin.com/company/pendamaze-studio/life",
    "location": null,
    "posted_date": "India · 16 hours ago · Over 100 applicants\n\nPromoted by hirer · No response insights available yet",
    "applicant_count": "India · 16 hours ago · Over 100 applicants\n\nPromoted by hirer · No response insights available yet",
    "job_url": "https://www.linkedin.com/jobs/view/4353703253/",
    "description": "About the job\n\nCompany Description\n\nPendamaze Studio, based in Kochi, India, is a premier game art outsourcing and game development studio dedicated to transforming creative ideas into exceptional games. Specializing in 2D art and animation, 3D game art, and game development services, the studio is committed to delivering high-quality, detail-oriented projects. Renowned for innovation, Pendamaze stays at the forefront of technology, constantly exploring new ideas to push the boundaries in gaming. Their talented team ensures a seamless process to help clients achieve their desired goals in the gaming industry.\n\n\n\n\nAbout The Role:\n\nWe’re looking for a Junior UX Designer with at least 1 year of experience. Working Experience on mobile games is Highly desirable but not Mandatory. We’re looking for someone who is passionate about mobile games, especially hyper-casual and hybrid-casual experiences. You’ll work closely with Game Design, Art, and other teams to design simple, intuitive, and engaging player flows that hook players within the first few seconds. This is a hands-on role where you’ll learn how UX directly impacts retention, engagement, and monetization in fast-paced mobile games.\n\n\n\n\nWhat You'll Do:\n\n\n\n\nUX & Player Experience:\n\nDesign player flows, wireframes, and low-fidelity mockups for hyper-casual games.\nCreate intuitive onboarding, tutorials, and first-time user experiences (FTUE).\nHelp improve core gameplay loops, menus, and feedback systems.\nCollaborate with Game Design to translate game mechanics into clean UX flows.\nWork with art to ensure UX aligns with visual style and clarity.\n\n\n\n\nTesting & Iteration:\n\nObserve gameplay and identify UX friction points.\nPropose UX improvements based on research and insights.\nSupport A/B testing ideas for menus, HUDs, and onboarding flows.\n\n\n\n\nTools & Documentation:\n\nCreate UX documentation, flowcharts, and interaction maps.\nUse tools like Figma, Miro, or similar.\nMaintain clean, reusable UX assets for rapid prototyping.\n\n\n\n\nWhat We’re Looking For (Must-Have)\n\nCompleted a degree in UX Design, Interaction Design, Game Design, HCI, or a related field.\nStrong interest in mobile games, especially hyper-casual titles.\nBasic understanding of UX principles (usability, feedback, hierarchy, affordances).\nUnderstanding with Figma or similar design tools.\nWillingness to iterate fast and learn through feedback.\n\n\n\n\nNice-to-Have:\n\nExperience working on hyper-casual games\nFamiliarity with hyper-casual UX principles \nBasic understanding of game design concepts (KPIs, retention, funnels)",
    "company_details": {
      "headquarters": null,
      "founded": null,
      "industry": null,
      "company_size": "11-50 employees"
    }
  },
  {
    "job_title": "ESG Researcher",
    "company": "NixOut",
    "company_url": "https://www.linkedin.com/company/nixout/life",
    "location": null,
    "posted_date": "India · 18 hours ago · Over 100 applicants\n\nPromoted by hirer · Company review time is typically 1 week",
    "applicant_count": "India · 18 hours ago · Over 100 applicants\n\nPromoted by hirer · Company review time is typically 1 week",
    "job_url": "https://www.linkedin.com/jobs/view/4363859572/",
    "description": "About the job\n\nJob Title: ESG Researcher\n\nLocation: Hybrid\n\nReports To: Co-Founder\n\n \n\nCompany Description\n\n \n\nNixOut empowers businesses in the food and retail sectors with sustainable packaging solutions derived from natural materials like plant leaves, banana fibre, bamboo, jute, and more. With a mission to reduce plastic waste and promote environmentally friendly growth, NixOut supports Startups, SMEs, and established brands in transitioning to zero-waste practices. Combining expertise in ethical sourcing and innovative design, NixOut provides custom-tailored packaging solutions that align with UK regulations and consumer sustainability demands. By offering a comprehensive range of products, from compostable containers to home-compostable bags, NixOut aims to create a greener future for both businesses and the planet\n\n\n\n\nAbout the Role\n\nWe are looking for a motivated ESG Intern to help shape the core sustainability knowledge base for our product. You will research ESG frameworks, standards, and metrics, and help translate them into data models. This is a hands-on role perfect for someone passionate about sustainability and emerging tech.\n\n\n\n\nKey Responsibilities\n\nResearch and summarise key ESG frameworks and emerging regulations worldwide (Especially Europe).\nAnalyse industry specific ESG metrics (including carbon emissions, supply-chain labour practices, diversity reporting).\nAssist in mapping ESG data points product structures (That includes how to tokenise or verify carbon credits, traceability in supply chains).\nConduct competitor and market research on ESG reporting and sustainability projects.\nHelp create content such as reports, blog posts, whitepaper sections, or pitch deck slides on ESG topics.\nSupport data collection and basic analysis (which is reviewing company sustainability reports, extracting key metrics).\nCollaborate with the founder on integrating ESG insights into product roadmap.\n\n\n\n\nRequired Qualifications\n\nCurrently pursuing Master's degree or completed a Bachelor's degree in Environmental Science, Sustainability Studies, Business Administration, Economics, Law, or related fields.\nStrong interest in ESG/Sustainability (prior coursework, projects, or personal initiatives are a big plus).\nBasic understanding of ESG concepts (you don't need to be an expert).\n\n\n\n\nEssential Skills\n\nExcellent research and analytical skills (able to read dense reports and extract key insights).\nStrong written English (for reports and documentation).\nProficiency in Microsoft Office (Docs, Excel, Sheets, & PowerPoint).\nAttention to detail and ability to organise information clearly.\n\n\n\n\nWhat We Offer\n\nOpportunity to work directly with the Founder on core business decisions.\nExposure to UK-focused international sourcing and B2B.\nHands-on experience in building a sustainable sourcing ecosystem from the ground up.\nPerformance-based growth, long-term role expansion.",
    "company_details": {
      "headquarters": null,
      "founded": null,
      "industry": null,
      "company_size": "2-10 employees"
    }
  },
  {
    "job_title": "User Experience Designer",
    "company": "Confidential",
    "company_url": "https://www.linkedin.com/company/confidential-company-page12/life",
    "location": null,
    "posted_date": "India · 20 hours ago · Over 100 applicants\n\nPromoted by hirer · No response insights available yet",
    "applicant_count": "India · 20 hours ago · Over 100 applicants\n\nPromoted by hirer · No response insights available yet",
    "job_url": "https://www.linkedin.com/jobs/view/4353772810/",
    "description": "About the job\n\nWe’re looking for a talented and detail-driven UI/UX Designer to join our product team.\n\nCandidate will be responsible for designing intuitive, user-centric experiences\n\nacross mobile and web platforms. You will translate user needs into functional, visually\n\nappealing interfaces that support the product vision and help grow our application into\n\na leading platform in the region.\n\n\n\n\nKey Responsibilities:\n\n\n\n\n• Collaborate with product managers and engineers to gather and evaluate user\n\nrequirements.\n\n• Design and deliver wireframes, prototypes, and user flows optimized for a wide\n\nrange of devices and interfaces.\n\n• Develop high-fidelity mock-ups and functional UI components aligned with our\n\nbranding guidelines.\n\n• Create and maintain style guides, UI kits, and reusable components.\n\n• Identify and troubleshoot UX issues, focusing on responsiveness, accessibility,\n\nand consistency.\n\n• Conduct layout refinements based on internal reviews and real user feedback.\n\n• Stay updated with emerging trends and tools in UI/UX design to continuously\n\nimprove design quality and efficiency.\n\n\n\n\nRequirements & Skills:\n\n\n\n\n2–4 years of professional experience as a UI/UX Designer with a strong portfolio\nof mobile-first projects.\nProven contribution to at least 2 apps currently lives on the Play Store or App\nStore.\nProficient in Figma, Adobe XD, or equivalent tools for design and prototyping.\nSolid understanding of user-cantered design principles and best practices.\nStrong ability to interpret user behavior and metrics to inform design decisions.\nExcellent visual design skills with a keen eye for layout, spacing, typography, and\ncolor.\nFull-Time Role | 100% Remote work",
    "company_details": {
      "headquarters": "Silicon Valley, California US",
      "founded": null,
      "industry": null,
      "company_size": "51-200 employees"
    }
  }
]