[
  {
    "job_title": "Video Annotator OCR Project- Remote",
    "company": "YO HR Consultancy",
    "company_url": "https://www.linkedin.com/company/yo-hr-consultancy-pvt-ltd",
    "location": null,
    "posted_date": "APAC · 5 minutes ago · 4 applicants\n\nPromoted by hirer · No response insights available yet",
    "applicant_count": "APAC · 5 minutes ago · 4 applicants\n\nPromoted by hirer · No response insights available yet",
    "job_url": "https://www.linkedin.com/jobs/view/4353774937/",
    "description": "About the job\n\nRole Overview\n\nPartnering with a top AI lab on a project to train and assess the ability of LLMs to evaluate video-based content. We\u0019re looking for extremely detail-oriented contributors to help carry out Optimal Character Recognition (OCR) work, where experts will list out every element of visual text they see in a video. This is a flexible opportunity that can fit any schedule.\n\nKey Responsibilities\n\n\nWrite out all elements of visual text seen in short videos.\nTimestamp each element of visual text with starting and ending timestamps.\nApply structured guidelines to ensure high-quality evaluations.\n\n\nIdeal Qualifications\n\n\nExperience in annotation, data labeling, or related content evaluation work.\nStrong English writing skills and ability to craft clear, specific questions and answers.\nExtreme attention to detail.\nComfortable working independently and managing flexible tasks with attention to detail.\nGeneral familiarity with multimedia content (e.g., videos from social media, how-tos, documentaries).\n\n\nMore About the Opportunity\n\n\nExpected commitment: 20-40 hours per week\n\n\nApplication Process\n\n\nSubmit your resume to begin.\nAfter submitting your resume, please complete a short AI interview and assessment.\nFollow-up typically occurs within 3 65 business days.\n\n\nWe consider all qualified applicants without regard to legally protected characteristics and provide reasonable accommodations upon request.\n\nContract and Payment Terms\n\n\nYou will be engaged as an independent contractor.\nThis is a fully remote role that can be completed on your own schedule.\nProjects can be extended, shortened, or concluded early depending on needs and performance.\nYour work will not involve access to confidential or proprietary information from any employer, client, or institution.\nPayments are weekly on Stripe or Wise based on services rendered.\n\n\nSkills: assessment,annotation,video,ocr,project",
    "company_details": {
      "headquarters": "70 associated members \nLinkedIn members who’ve listed YO HR Consultancy as their current workplace on their profile.",
      "founded": "Indore, Madhya Pradesh",
      "industry": "Business Consulting and Services",
      "company_size": "51-200 employees"
    }
  }
]